MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TFAGFP/mcu.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	__IS( x )		ICU.GRP ## x.BIT.IS ## x
#define	 _IS( x )		__IS( x )
#define	  IS( x , y )	_IS( _ ## x ## _ ## y )
#define	__EN( x )		ICU.GEN ## x.BIT.EN ## x
#define	 _EN( x )		__EN( x )
#define	  EN( x , y )	_EN( _ ## x ## _ ## y )
#define	__CLR( x )		ICU.GCR ## x.BIT.CLR ## x
#define	 _CLR( x )		__CLR( x )
#define	  CLR( x , y )	_CLR( _ ## x ## _ ## y )

#define	BSC		(*(volatile struct st_bsc     *)0x81300)
#define	CAC		(*(volatile struct st_cac     *)0x8B000)
#define	CANFD	(*(volatile struct st_canfd   *)0xA8014)
#define	CANFD0	(*(volatile struct st_canfd0  *)0xA8000)
#define	CMPC0	(*(volatile struct st_cmpc    *)0xA0C80)
#define	CMPC1	(*(volatile struct st_cmpc    *)0xA0CA0)
#define	CMPC2	(*(volatile struct st_cmpc    *)0xA0CC0)
#define	CMPC3	(*(volatile struct st_cmpc    *)0xA0CE0)
#define	CMPC4	(*(volatile struct st_cmpc    *)0xA0D00)
#define	CMPC5	(*(volatile struct st_cmpc    *)0xA0D20)
#define	CMT		(*(volatile struct st_cmt     *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0    *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0    *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0    *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0    *)0x88018)
#define	CMTW0	(*(volatile struct st_cmtw    *)0x94200)
#define	CMTW1	(*(volatile struct st_cmtw    *)0x94280)
#define	CRC		(*(volatile struct st_crc     *)0x88280)
#define	DA		(*(volatile struct st_da      *)0x88040)
#define	DMAC	(*(volatile struct st_dmac    *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0   *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1   *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1   *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1   *)0x820C0)
#define	DMAC4	(*(volatile struct st_dmac1   *)0x82100)
#define	DMAC5	(*(volatile struct st_dmac1   *)0x82140)
#define	DMAC6	(*(volatile struct st_dmac1   *)0x82180)
#define	DMAC7	(*(volatile struct st_dmac1   *)0x821C0)
#define	DOC		(*(volatile struct st_doc     *)0xA0580)
#define	DTC		(*(volatile struct st_dtc     *)0x82400)
#define	ELC		(*(volatile struct st_elc     *)0x8B100)
#define	FLASH	(*(volatile struct st_flash   *)0x8C294)
#define	GPTW	(*(volatile struct st_gptw    *)0xC2B00)
#define	GPTW0	(*(volatile struct st_gptw0   *)0xC2000)
#define	GPTW1	(*(volatile struct st_gptw0   *)0xC2100)
#define	GPTW2	(*(volatile struct st_gptw0   *)0xC2200)
#define	GPTW3	(*(volatile struct st_gptw0   *)0xC2300)
#define	GPTW4	(*(volatile struct st_gptw0   *)0xC2400)
#define	GPTW5	(*(volatile struct st_gptw0   *)0xC2500)
#define	GPTW6	(*(volatile struct st_gptw0   *)0xC2600)
#define	GPTW7	(*(volatile struct st_gptw0   *)0xC2700)
#define	HRPWM	(*(volatile struct st_hrpwm   *)0xC2A00)
#define	ICU		(*(volatile struct st_icu     *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt    *)0x88030)
#define	MPC		(*(volatile struct st_mpc     *)0x8C11F)
#define	MPU		(*(volatile struct st_mpu     *)0x86400)
#define	MTU		(*(volatile struct st_mtu     *)0xC120A)
#define	MTU0	(*(volatile struct st_mtu0    *)0xC1290)
#define	MTU1	(*(volatile struct st_mtu1    *)0xC1290)
#define	MTU2	(*(volatile struct st_mtu2    *)0xC1292)
#define	MTU3	(*(volatile struct st_mtu3    *)0xC1200)
#define	MTU4	(*(volatile struct st_mtu4    *)0xC1200)
#define	MTU5	(*(volatile struct st_mtu5    *)0xC1A94)
#define	MTU6	(*(volatile struct st_mtu6    *)0xC1A00)
#define	MTU7	(*(volatile struct st_mtu7    *)0xC1A00)
#define	MTU9	(*(volatile struct st_mtu9    *)0xC1296)
#define	OFSM	(*(volatile struct st_ofsm    *)0x120040)
#define	POE		(*(volatile struct st_poe     *)0x9E400)
#define	POEG	(*(volatile struct st_poeg    *)0x9E000)
#define	PORT	(*(volatile struct st_port    *)0x8C110)
#define	PORT0	(*(volatile struct st_port0   *)0x8C000)
#define	PORT1	(*(volatile struct st_port1   *)0x8C001)
#define	PORT2	(*(volatile struct st_port2   *)0x8C002)
#define	PORT3	(*(volatile struct st_port3   *)0x8C003)
#define	PORT4	(*(volatile struct st_port4   *)0x8C004)
#define	PORT5	(*(volatile struct st_port5   *)0x8C005)
#define	PORT6	(*(volatile struct st_port6   *)0x8C006)
#define	PORT7	(*(volatile struct st_port7   *)0x8C007)
#define	PORT8	(*(volatile struct st_port8   *)0x8C008)
#define	PORT9	(*(volatile struct st_port9   *)0x8C009)
#define	PORTA	(*(volatile struct st_porta   *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb   *)0x8C00B)
#define	PORTD	(*(volatile struct st_portd   *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte   *)0x8C00E)
#define	PORTN	(*(volatile struct st_portn   *)0x8C016)
#define	RAM		(*(volatile struct st_ram     *)0x81200)
#define	RI3C0	(*(volatile struct st_ri3c    *)0xEC000)
#define	RIIC0	(*(volatile struct st_riic    *)0x88300)
#define	RSCI8	(*(volatile struct st_rsci8   *)0xA1400)
#define	RSCI9	(*(volatile struct st_rsci9   *)0xA1480)
#define	RSCI11	(*(volatile struct st_rsci11  *)0xE2080)
#define	RSPI0	(*(volatile struct st_rspi    *)0xD0100)
#define	RSPIA0	(*(volatile struct st_rspia   *)0xE2800)
#define	S12AD	(*(volatile struct st_s12ad   *)0x89000)
#define	S12AD1	(*(volatile struct st_s12ad1  *)0x89200)
#define	S12AD2	(*(volatile struct st_s12ad2  *)0x89400)
#define	SCI1	(*(volatile struct st_sci1    *)0x8A020)
#define	SCI5	(*(volatile struct st_sci1    *)0x8A0A0)
#define	SCI6	(*(volatile struct st_sci1    *)0x8A0C0)
#define	SCI12	(*(volatile struct st_sci12   *)0x8B300)
#define	SMCI1	(*(volatile struct st_smci    *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci    *)0x8A0A0)
#define	SMCI6	(*(volatile struct st_smci    *)0x8A0C0)
#define	SMCI12	(*(volatile struct st_smci    *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system  *)0x80000)
#define	TEMPS	(*(volatile struct st_temps   *)0x7FB17C)
#define	TFU		(*(volatile struct st_tfu     *)0x81404)
#define	TMR0	(*(volatile struct st_tmr0    *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1    *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0    *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1    *)0x88211)
#define	TMR4	(*(volatile struct st_tmr4    *)0x88220)
#define	TMR5	(*(volatile struct st_tmr5    *)0x88221)
#define	TMR6	(*(volatile struct st_tmr4    *)0x88230)
#define	TMR7	(*(volatile struct st_tmr5    *)0x88231)
#define	TMR01	(*(volatile struct st_tmr01   *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01   *)0x88214)
#define	TMR45	(*(volatile struct st_tmr01   *)0x88224)
#define	TMR67	(*(volatile struct st_tmr01   *)0x88234)
#define	WDT		(*(volatile struct st_wdt     *)0x88020)

typedef enum enum_ir {
IR_BSC_BUSERR=16,IR_RAM_RAMERR=18,
IR_FCU_FIFERR=21,IR_FCU_FRDYI=23,
IR_ICU_SWINT2=26,IR_ICU_SWINT,
IR_CMT0_CMI0,
IR_CMT1_CMI1,
IR_CMT2_CMI2,
IR_CMT3_CMI3,
IR_RSPI0_SPRI0=38,IR_RSPI0_SPTI0,
IR_RI3C0_RESPI,IR_RI3C0_CMDI,IR_RI3C0_IBII,IR_RI3C0_RCVI,
IR_RSPIA0_SPRI=48,IR_RSPIA0_SPTI,
IR_RIIC0_RXI0=52,IR_RIIC0_TXI0,
IR_SCI1_RXI1=60,IR_SCI1_TXI1,
IR_ICU_IRQ0=64,IR_ICU_IRQ1,IR_ICU_IRQ2,IR_ICU_IRQ3,IR_ICU_IRQ4,IR_ICU_IRQ5,IR_ICU_IRQ6,IR_ICU_IRQ7,
IR_ICU_IRQ8,IR_ICU_IRQ9,IR_ICU_IRQ10,IR_ICU_IRQ11,IR_ICU_IRQ12,IR_ICU_IRQ13,IR_ICU_IRQ14,IR_ICU_IRQ15,
IR_SCI5_RXI5=84,IR_SCI5_TXI5,
IR_SCI6_RXI6,IR_SCI6_TXI6,
IR_LVD1_LVD1,
IR_LVD2_LVD2,
IR_IWDT_IWUNI=95,
IR_WDT_WUNI,
IR_RSCI8_RXI=100,IR_RSCI8_TXI,
IR_RSCI9_RXI,IR_RSCI9_TXI,
IR_ICU_GROUPBL2=107,IR_ICU_GROUPBL0=110,IR_ICU_GROUPBL1,IR_ICU_GROUPAL0,IR_ICU_GROUPAL1,
IR_RSCI11_RXI,IR_RSCI11_TXI,
IR_SCI12_RXI12,IR_SCI12_TXI12,
IR_RI3C0_RXI,IR_RI3C0_TXI,
IR_DMAC_DMAC0I,IR_DMAC_DMAC1I,IR_DMAC_DMAC2I,IR_DMAC_DMAC3I,IR_DMAC_DMAC74I,
IR_OST_OSTDI,
IR_S12AD_S12ADI=128,IR_S12AD_S12GBADI,IR_S12AD_S12GCADI,
IR_S12AD1_S12ADI1=132,IR_S12AD1_S12GBADI1,IR_S12AD1_S12GCADI1,
IR_S12AD2_S12ADI2=136,IR_S12AD2_S12GBADI2,IR_S12AD2_S12GCADI2,
IR_CANFD_RFDREQ0=140,IR_CANFD_RFDREQ1,
IR_CANFD0_CFDREQ0,
IR_TMR0_CMIA0=146,IR_TMR0_CMIB0,IR_TMR0_OVI0,
IR_TMR1_CMIA1,IR_TMR1_CMIB1,IR_TMR1_OVI1,
IR_TMR2_CMIA2,IR_TMR2_CMIB2,IR_TMR2_OVI2,
IR_TMR3_CMIA3,IR_TMR3_CMIB3,IR_TMR3_OVI3,
IR_TMR4_CMIA4,IR_TMR4_CMIB4,IR_TMR4_OVI4,
IR_TMR5_CMIA5,IR_TMR5_CMIB5,IR_TMR5_OVI5,
IR_TMR6_CMIA6,IR_TMR6_CMIB6,IR_TMR6_OVI6,
IR_TMR7_CMIA7,IR_TMR7_CMIB7,IR_TMR7_OVI7,
IR_ELC_ELSR18I=175,IR_ELC_ELSR19I,
IR_TSIP_RD,IR_TSIP_WR,IR_TSIP_ERR,
IR_CMPC0_CMPC0,
IR_CMPC1_CMPC1,
IR_CMPC2_CMPC2,
IR_CMPC3_CMPC3,
IR_CMPC4_CMPC4,
IR_CMPC5_CMPC5,
IR_CMTW0_CMWI0,IR_CMTW0_IC0I0,IR_CMTW0_IC1I0,IR_CMTW0_OC0I0,IR_CMTW0_OC1I0,
IR_CMTW1_CMWI1,IR_CMTW1_IC0I1,IR_CMTW1_IC1I1,IR_CMTW1_OC0I1,IR_CMTW1_OC1I1,
IR_RSCI9_AED=197,
IR_PERIA_INTA208=208,IR_PERIA_INTA209,IR_PERIA_INTA210,IR_PERIA_INTA211,IR_PERIA_INTA212,IR_PERIA_INTA213,
IR_PERIA_INTA214,IR_PERIA_INTA215,IR_PERIA_INTA216,IR_PERIA_INTA217,IR_PERIA_INTA218,IR_PERIA_INTA219,
IR_PERIA_INTA220,IR_PERIA_INTA221,IR_PERIA_INTA222,IR_PERIA_INTA223,IR_PERIA_INTA224,IR_PERIA_INTA225,
IR_PERIA_INTA226,IR_PERIA_INTA227,IR_PERIA_INTA228,IR_PERIA_INTA229,IR_PERIA_INTA230,IR_PERIA_INTA231,
IR_PERIA_INTA232,IR_PERIA_INTA233,IR_PERIA_INTA234,IR_PERIA_INTA235,IR_PERIA_INTA236,IR_PERIA_INTA237,
IR_PERIA_INTA238,IR_PERIA_INTA239,IR_PERIA_INTA240,IR_PERIA_INTA241,IR_PERIA_INTA242,IR_PERIA_INTA243,
IR_PERIA_INTA244,IR_PERIA_INTA245,IR_PERIA_INTA246,IR_PERIA_INTA247,IR_PERIA_INTA248,IR_PERIA_INTA249,
IR_PERIA_INTA250,IR_PERIA_INTA251,IR_PERIA_INTA252,IR_PERIA_INTA253,IR_PERIA_INTA254,IR_PERIA_INTA255
} enum_ir_t;

